app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."hiperlink" = 'service' LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	if params[:hiperlink]
	    @page = Page.find_by_hiperlink(params[:hiperlink])
	  else
	  	@page = Page.find(params[:id])